Repository: pdaus-1/NY-CDL-Permit
Catalog: NY CDL Permit/*.lproj/Localizable.strings
Languages: es

# homeWelcome
source: Welcome to the NY CDL Permit App. Prepare for your test with questions in multiple languages.
es: Bienvenido a la aplicación NY CDL. Practica con preguntas en varios idiomas.

# selectSubject
source: Select a Subject
es: Selecciona una materia

# invalidPhoneNumber
source: Invalid phone number format.
es: Número de teléfono inválido. Debe tener 10 dígitos.

# codeSentSuccess
source: Verification code sent.
es: Código de verificación enviado.

# enterPhone
source: Enter phone number
es: Ingresa tu número de teléfono

# sendCode
source: Send Verification Code
es: Enviar código

# enterCode
source: Enter verification code
es: Ingresa el código

source: Confirm
es: Confirmar

# notAuthorized
source: ❌ Your phone number is not authorized. Please contact J&S School.
es: ❌ Tu número no está autorizado. Contacta con J&S School.

# firebaseError
source: Firebase error, please try again
es: Error de Firebase, inténtelo de nuevo

# resultTitle
source: Your Result
es: Tu resultado

# yourScore
source: Score
es: Puntaje

# pass
source: 🎉 Passed!
es: 🎉 ¡Aprobado!

# fail
source: ❌ Not Passed
es: ❌ No aprobado

source: Try Again
es: Intentar otra vez

source: Exit
es: Salir

source: Question
es: Pregunta

# core
source: General Knowledge (Core)
es: Conocimiento General (Core)

source: Air Brake
es: Freno de aire (Air Brake)

# combination
source: Combination Vehicles
es: Vehículos combinados (Combination)

# passenger
source: Passenger Endorsement
es: Vehículos de pasajeros (Passenger)

# schoolbus
source: School Bus Endorsement
es: Autobús escolar (School Bus)

# unanswered
source: You have unanswered questions. Review them?
es: Tienes preguntas sin responder. ¿Revisarlas?

source: Yes
es: Sí

source: Next
es: Siguiente

source: Finish
es: Finalizar

# emptyPhoneNumber
source: Please enter your phone number.
es: Por favor, ingresa tu número de teléfono.

# invalidVerificationCode
source: Incorrect verification code. Please check and try again.
es: El código de verificación es incorrecto. Intenta de nuevo.

# tooManyRequests
source: Too many attempts. Please try again later.
es: Demasiados intentos. Inténtalo más tarde.

# userDisabled
source: This account has been disabled.
es: Esta cuenta ha sido deshabilitada.

# networkError
source: Network error. Please check your internet connection.
es: Error de red. Revisa tu conexión a Internet.

# unknownError
source: An unknown error occurred. Please try again.
es: Ocurrió un error desconocido. Intenta más tarde.

# appCheckFailed
source: App Check failed. Please test on a real device or check your configuration.
es: App Check falló. Prueba en un dispositivo real o revisa la configuración.
